app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    if (!params[:sort] && !params[:ratings])
       if (session[:sort] && session[:ratings])
          flash.keep
          redirect_to movies_path(:sort => session[:sort], :ratings => session[:ratings])
       end
    end

    if params[:sort]
       session[:sort] = params[:sort]
    end

    if params[:ratings]
       session[:ratings] = params[:ratings]
    end

    @all_ratings = Movie.all_ratings
    @checked = @all_ratings
    @action = session[:sort]
    if !params[:ratings].nil?
       @checked = session[:ratings].keys
    end
    if @action
       if @action == 'title'
          @class_title = 'hilite'
          @movies =Movie.where(:rating => @checked).order('title')
       else
          @class_date = 'hilite'
          @movies =Movie.where(:rating => @checked).order("release_date")